{"config": [{"config": {"name": "conv2d_1", "bias_constraint": null, "padding": "same", "batch_input_shape": [null, 1, 48, 48], "dtype": "float32", "kernel_regularizer": null, "filters": 32, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activation": "relu", "strides": [1, 1], "trainable": true, "use_bias": true, "activity_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "conv2d_2", "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "filters": 32, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activation": "relu", "strides": [1, 1], "trainable": true, "use_bias": true, "activity_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_3", "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "filters": 32, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activation": "relu", "strides": [1, 1], "trainable": true, "use_bias": true, "activity_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_4", "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "filters": 64, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activation": "relu", "strides": [1, 1], "trainable": true, "use_bias": true, "activity_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "conv2d_5", "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "filters": 64, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activation": "relu", "strides": [1, 1], "trainable": true, "use_bias": true, "activity_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_6", "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "filters": 64, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activation": "relu", "strides": [1, 1], "trainable": true, "use_bias": true, "activity_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_7", "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "filters": 128, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activation": "relu", "strides": [1, 1], "trainable": true, "use_bias": true, "activity_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "conv2d_8", "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "filters": 128, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activation": "relu", "strides": [1, 1], "trainable": true, "use_bias": true, "activity_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_9", "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "filters": 128, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activation": "relu", "strides": [1, 1], "trainable": true, "use_bias": true, "activity_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_3", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_4", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "bias_constraint": null, "units": 1024, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "activation": "relu", "trainable": true, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_5", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "bias_constraint": null, "units": 512, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "activation": "relu", "trainable": true, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_6", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "bias_constraint": null, "units": 6, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "softmax", "trainable": true, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.3", "backend": "tensorflow", "class_name": "Sequential"}