{"keras_version": "2.0.3", "config": [{"config": {"strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "filters": 32, "use_bias": true, "batch_input_shape": [null, 1, 48, 48], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "name": "conv2d_1", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "filters": 32, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "filters": 32, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "filters": 64, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "name": "conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "filters": 64, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "name": "conv2d_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "filters": 64, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "name": "conv2d_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "filters": 128, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "name": "conv2d_7", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "filters": 128, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "name": "conv2d_8", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "filters": 128, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "name": "conv2d_9", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_3", "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 64, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_1", "activation": "relu", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 64, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_2", "activation": "relu", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 6, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_3", "activation": "softmax", "bias_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}