{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "use_bias": true, "bias_regularizer": null, "name": "conv2d_1", "batch_input_shape": [null, 1, 48, 48], "trainable": true, "strides": [1, 1], "padding": "same"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "use_bias": true, "bias_regularizer": null, "name": "conv2d_2", "padding": "same", "trainable": true, "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "use_bias": true, "bias_regularizer": null, "name": "conv2d_3", "padding": "same", "trainable": true, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 64, "use_bias": true, "bias_regularizer": null, "name": "conv2d_4", "padding": "same", "trainable": true, "strides": [1, 1]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 64, "use_bias": true, "bias_regularizer": null, "name": "conv2d_5", "padding": "same", "trainable": true, "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 64, "use_bias": true, "bias_regularizer": null, "name": "conv2d_6", "padding": "same", "trainable": true, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 128, "use_bias": true, "bias_regularizer": null, "name": "conv2d_7", "padding": "same", "trainable": true, "strides": [1, 1]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_3"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 128, "use_bias": true, "bias_regularizer": null, "name": "conv2d_8", "padding": "same", "trainable": true, "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 128, "use_bias": true, "bias_regularizer": null, "name": "conv2d_9", "padding": "same", "trainable": true, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "pool_size": [2, 2], "trainable": true, "data_format": "channels_first"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "name": "dense_1", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "relu", "bias_regularizer": null, "units": 1024, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "name": "dense_2", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "relu", "bias_regularizer": null, "units": 512, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "dense_3", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "softmax", "bias_regularizer": null, "units": 6, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.0.3"}