{"keras_version": "2.0.3", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "strides": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "filters": 32, "data_format": "channels_last", "batch_input_shape": [null, 1, 48, 48], "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "padding": "same"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "filters": 32, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "padding": "same"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "filters": 32, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "padding": "same"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_first", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "padding": "same"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "padding": "same"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "padding": "same"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_first", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "filters": 128, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "padding": "same"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.2}}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "filters": 128, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "padding": "same"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "filters": 128, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "padding": "same"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_first", "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "units": 1024, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "units": 512, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "bias_constraint": null, "activation": "softmax", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "units": 6, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}]}