{"config": [{"config": {"data_format": "channels_last", "batch_input_shape": [null, 1, 48, 48], "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "relu", "name": "conv2d_1", "bias_constraint": null, "dtype": "float32", "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "padding": "same", "filters": 32}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "name": "conv2d_2", "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "filters": 32}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "name": "conv2d_3", "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "filters": 32}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_first", "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "name": "conv2d_4", "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "filters": 64}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "name": "conv2d_5", "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "filters": 64}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "name": "conv2d_6", "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "filters": 64}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_first", "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "name": "conv2d_7", "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "filters": 128}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "name": "conv2d_8", "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "filters": 128}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "name": "conv2d_9", "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "filters": 128}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_first", "name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 64, "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 64, "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "name": "dense_2", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 6, "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "name": "dense_3", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.3"}